import { ReviewItem } from '../../types';

export const reviews: ReviewItem[] = [
  {
    id: "1",
    author: "Дмитрий",
    date: "22 сентября 2023",
    rating: 5,
    text: "Спасибо компании за возможность заказать тягач из Европы, пришёл через месяц, забрал, все отлично. Менеджер подробно ответил на все вопросы, в любое время дня и ночи был на связи, за что отдельное спасибо. Советую к работе.",
    productName: "Mercedes-Benz Actros 1848 LS, 2021",
    reply: {
      author: "ProTechMoto",
      date: "5 октября 2023",
      text: "Благодарим за отзыв! Спасибо, чтобы выбрали нас!"
    }
  },
  {
    id: "2",
    author: "Азамат",
    date: "30 августа 2023",
    rating: 5,
    text: "Рад что нашел вашу компанию, приобрел тягач SCANIA под заказ из Европы до Ростовской области, пришел ко мне через месяц. Тягач отличный, техническое состояние идеальное, компания не подвела! Большое вам спасибо.",
    productName: "Scania R450, 2020",
    reply: {
      author: "ProTechMoto",
      date: "30 августа 2023",
      text: "Добрый день! Благодарим за отзыв! Мы рады, что вы обратились в нашу компанию."
    }
  },
  {
    id: "3",
    author: "максим",
    date: "14 августа 2023",
    rating: 5,
    text: "Приобретал тягач из Германии через данную компанию, пришёл спустя месяц, в заявленные сроки. Компания отличная, делают свою работу на уровне, всегда обо всём оповещали и ответили на все интересующие вопросы, спасибо!",
    productName: "DAF XG 480 FT, 2023",
    reply: {
      author: "ProTechMoto",
      date: "15 августа 2023",
      text: "Добрый день! Благодарим за отзыв! Мы рады, что вы обратились в нашу компанию."
    }
  },
  {
    id: "4",
    author: "Григорий Румянцев",
    date: "26 июня 2023",
    rating: 5,
    text: "Заказал в этой компании тягач. Пришёл примерно через месяц, в отличном состоянии, все рабочее, как и рассказывал дилер. Компанией доволен, как и тягачом. Спасибо.",
    productName: "IVECO S-Way 430, 2023",
    reply: {
      author: "ProTechMoto",
      date: "15 августа 2023",
      text: "Добрый день! Благодарим за отзыв! Мы рады, что вы обратились в нашу компанию."
    }
  },
  {
    id: "5",
    author: "Морозова Татьяна",
    date: "6 июня 2023",
    rating: 5,
    text: "Отличный тягач, компания просто супер! Доставили в отличном состоянии, все хорошо. Спасибо.",
    productName: "Volvo FH 460, 2019",
    reply: {
      author: "ProTechMoto",
      date: "14 июня 2023",
      text: "Добрый день! Благодарим за отзыв! Мы рады, что вы обратились в нашу компанию."
    }
  },
  {
    id: "6",
    author: "Денис",
    date: "26 мая 2023",
    rating: 5,
    text: "Отличный тягач за такую стоимость, доставили в обещанные сроки, все как на фото, спасибо!",
    productName: "Mercedes-Benz Actros, 2015",
    reply: {
      author: "ProTechMoto",
      date: "1 июня 2023",
      text: "Добрый день! Благодарим за отзыв и высокую оценку! Спасибо за приятное сотрудничество!"
    }
  },
  {
    id: "7",
    author: "Тимур Бекмамбетов",
    date: "17 мая 2023",
    rating: 5,
    text: "Отличный тягач, мощный, доставку из Европы ждал около месяца, в общем недолго, не пришлось доплачивать компании за доставку транспорта и прочих услуг, порадовало конечно. Компания супер, отличные специалисты 👍, ответили на все интересующие вопросы, помогли с покупкой, спасибо.",
    productName: "Scania R450, 2021",
    reply: {
      author: "ProTechMoto",
      date: "1 июня 2023",
      text: "Добрый день! Спасибо за отзыв! Было приятно посотрудничать с вами!"
    }
  },
  {
    id: "8",
    author: "Анастасия Глинкина",
    date: "3 мая 2023",
    rating: 5,
    text: "Всё отлично) ребята супер профессионалы своего дела. Проконсультировали по интересующим вопросам и помогли. Услуга была оказана в полном объеме.",
    productName: "Оформление эптс / сбктс / эра-глонасс/ зоетс/ нами",
    reply: {
      author: "ProTechMoto",
      date: "1 июня 2023",
      text: "Добрый день! Спасибо, что обратились в нашу компанию) будем рады вас видеть снова)"
    }
  },
  {
    id: "9",
    author: "Максим Глинкин",
    date: "28 апреля 2023",
    rating: 5,
    text: "Приятно общаться , много разных услуг , хороший сервис",
    productName: "Оформление эптс / сбктс / эра-глонасс/ зоетс/ нами",
    reply: {
      author: "ProTechMoto",
      date: "1 июня 2023",
      text: "Добрый день! Спасибо, что обратились к нам! Будем рады видеть вас снова!"
    }
  },
  {
    id: "10",
    author: "Александр",
    date: "15 апреля 2023",
    rating: 5,
    text: "Заказывал тягач через эту компанию. Все прошло отлично, доставили в срок, качество на высоте. Рекомендую!",
    productName: "Volvo FH 460, 2020",
    reply: {
      author: "ProTechMoto",
      date: "20 апреля 2023",
      text: "Спасибо за отзыв! Рады, что вы остались довольны нашим сервисом!"
    }
  }
]; 